{
  "title": "Paul the Panda",
  "synopsis": "Paul's clumsy attempts to win the heart of Grace the Giraffe at the city zoo.",
  "visual_style": "1940s comic inspired style with muted, slightly unnatural colors and strong contrast. Clean, restrained ink linework and flat color fills, creating a professional, graphic look with restrained expressions and mature proportions. Extremely minimal detail with sparse backgrounds, few elements, and generous empty space. Full bleed composition with no borders, frames, or panel lines. Artistic, intentionally simple, and free of anything modern or cute.",
  "locations": [
    {
      "name": "City Zoo",
      "description": "A small traditional zoo with stone-walled enclosures, winding visitor paths, old oak trees, and a central fountain. Animals roam freely between exhibits during social hours."
    },
    {
      "name": "Panda Enclosure",
      "description": "A bamboo-filled enclosure with a tire swing, a shallow pond, and a cozy wooden shelter. Paul's home turf."
    },
    {
      "name": "Giraffe Paddock",
      "description": "A tall-fenced open paddock with acacia trees. Grace's elegant domain."
    }
  ],
  "characters": [
    {
      "name": "Paul",
      "description": "A round, chubby giant panda with expressive dark eyes and a slightly dopey, charming smile. Well-meaning, clumsy, and hopelessly romantic."
    },
    {
      "name": "Grace",
      "description": "A tall, graceful giraffe with warm golden-brown patches, long eyelashes, and a calm, composed demeanor. Kind but oblivious to Paul's advances."
    }
  ],
  "rules": [
    "The animals behave like animals but with human-like emotions and social dynamics.",
    "Paul's attempts to impress Grace should always backfire in funny, physical-comedy ways."
  ],
  "long_term_narrative": [
    "Paul keeps finding creative but doomed ways to get Grace's attention.",
    "Each attempt escalates in ambition and comedic disaster."
  ],
  "final_outcomes": [
    "Paul wins Grace's heart and they become an unlikely but adorable couple",
    "Grace rejects Paul and he is left heartbroken"
  ]
}
