{
  "title": "Paul the Panda",
  "synopsis": "Paul's clumsy attempts to win the heart of Grace the Giraffe at the city zoo.",
  "visual_style": "1920s vintage illustration style with colorful but faded tones and restrained ink linework. Hand-drawn and slightly unfinished, with subtle imperfections and confident, deliberate lines from a professional illustrator. Extremely minimal detail: sparse backgrounds, few elements, and generous empty space. Artistic, old-fashioned, and unpolished—nothing modern or childish. Single full-bleed image with no frames, borders, or panels.",
  "locations": [
    {
      "name": "City Zoo",
      "description": "A large traditional zoo with stone-walled enclosures, winding visitor paths, old oak trees, and a central fountain. Animals roam freely between exhibits during social hours."
    },
    {
      "name": "Panda Enclosure",
      "description": "A bamboo-filled enclosure with a tire swing, a shallow pond, and a cozy wooden shelter. Paul's home turf."
    },
    {
      "name": "Giraffe Paddock",
      "description": "A tall-fenced open paddock with acacia trees and elevated feeding platforms. Grace's elegant domain."
    }
  ],
  "characters": [
    {
      "name": "Paul",
      "description": "A round, chubby giant panda with soft black-and-white fur, expressive dark eyes, and a slightly dopey but endearing smile. Well-meaning, clumsy, and hopelessly romantic."
    },
    {
      "name": "Grace",
      "description": "A tall, graceful giraffe with warm golden-brown patches, long eyelashes, and a calm, composed demeanor. Kind but oblivious to Paul's advances."
    }
  ],
  "rules": [
    "The animals behave like animals but with human-like emotions and social dynamics.",
    "Paul's attempts to impress Grace should always backfire in funny, physical-comedy ways.",
    "The tone is always warm and lighthearted — never mean-spirited."
  ],
  "long_term_narrative": [
    "Paul keeps finding creative but doomed ways to get Grace's attention.",
    "Each attempt escalates in ambition and comedic disaster."
  ],
  "final_outcomes": [
    "Paul wins Grace's heart and they become an unlikely but adorable couple",
    "Grace rejects Paul and he is left heartbroken"
  ]
}
