{
  "title": "Pandaen Pål",
  "synopsis": "Påls klumsete forsøk på å vinne hjertet til Sjiraffen Sofie.",
  "visual_style": "Minimal, graphic comic illustration with a cubist-inspired layout. Characters are highly readable silhouettes with thick, consistent black outlines and flat fills. Environments are abstract geometry: overlapping rectangles, arcs, and large color blocks that suggest location rather than depict it. Backgrounds are mostly empty with generous negative space. The color palette is warm ochre and off-white, with muted teal and brick red as accents. Shadows are single, flat shapes. Avoid gradients, textures, complex patterns, tiny details, cute or chibi proportions, big sparkly eyes, blush, detailed fur, realistic scenery, clutter, painterly shading, and any modern glossy look.",
  "locations": [
    {
      "name": "Dyreparken",
      "description": "A small, traditional zoo with red brick walls, stone foundations, iron railings, and simple, old-fashioned animal enclosures typical of early 20th-century zoos."
    },
    {
      "name": "Pandainnhegningen",
      "description": "A bamboo-filled enclosure with a tire swing, a shallow pond, and a small wooden shelter that is slightly too cramped for Pål."
    }
  ],
  "characters": [
    {
      "name": "Pål",
      "description": "A stout panda made from simple, rounded shapes, with a large body, small head, and short limbs. Minimal face with small calm eyes and a simple mouth. His expression is neutral, often with a soft, blank, slightly puzzled look that adds quiet humor."
    },
    {
      "name": "Sofie",
      "description": "A tall giraffe built from clean, simple shapes, with a long neck drawn as one smooth curve and a head shaped like a soft wedge. Minimal spots shown as just a few clear marks. Calm expression with a subtle smile or slightly softened eyes, never sweet or cute."
    }
  ],
  "rules": [
    "The animals behave like animals but with human-like emotions and social dynamics.",
    "Comedy comes from physical comedy, body language, and timing — not exaggerated facial expressions.",
    "The tone is light, witty, and slightly silly — think Pixar humor: accessible on the surface, with subtle irony, self-awareness, and understated jokes that adults recognize and enjoy.",
    "Sofie's dialogue should be dry, deadpan, and cleverly understated — never too sweet, encouraging, or overly kind. She's amused, not charmed.",
    "Narration should be wry and observational, like a nature documentary narrator who's slowly losing professional composure. Avoid anything earnest, sentimental, or children's-book-like."
  ],
  "long_term_narrative": [
    "Each attempt to impress Sofie escalates in ambition and comedic disaster."
  ],
  "narrative_premise": "Pål is hopelessly in love with Sofie and keeps finding creative but doomed ways to win her heart. His attempts always backfire in physical-comedy fashion, but he never gives up — and Sofie is always just entertained enough by the chaos to stick around, though she'd never let him know that."
}
