{
  "title": "The Jade Falcon Mystery",
  "synopsis": "In the rain-soaked streets of Noirville, 1947. A down-on-your-luck private detective, a mysterious case, and secrets that run deeper than the fog. Every shadow hides a secret, every smile hides a lie.",
  "setting": "A noir-style 1940s city called Noirville, filled with shadowy alleys, smoky jazz clubs, and characters with secrets to hide. Rain is always threatening, streetlights flicker, and everyone has an angle. It's a world of fedoras and femme fatales, of whiskey and worn leather, of cases that start simple and end deadly. The city never sleeps, and neither do its secrets.",
  "starting_location": {
    "name": "Detective's Office",
    "description": "A cramped office on the third floor of the Baxter Building. A frosted glass door reads 'Private Investigations'. Inside, a battered wooden desk drowns in papers, case files, and yesterday's coffee. A half-empty bottle of bourbon sits in the drawer for the bad days. The ceiling fan wobbles with each rotation, and the rain-streaked window overlooks the wet streets below. It's not much, but it's home.",
    "visual_description": "Small 1940s detective office, frosted glass door, cluttered wooden desk with papers, ceiling fan, rain-streaked window overlooking city, filing cabinets, noir lighting with venetian blind shadows, desk lamp creating pools of light"
  },
  "main_character": {
    "name": "Sam Noir",
    "description": "A weathered private detective with a sharp mind and a troubled past. Wearing a rumpled grey trench coat and a fedora that's seen better days. Has a strong jaw, tired eyes that have seen too much, and a five o'clock shadow. Speaks in a world-weary voice but still believes in doing the right thing. Chain smokes when nervous. Quick with a quip and quicker with his fists when needed."
  },
  "goal": "Create a classic noir detective story with mystery, intrigue, and dramatic twists. Unravel cases, meet colorful characters, and navigate a city where everyone has something to hide.",
  "visual_style": "noir comic book style, high contrast black and white with dramatic shadows, rain-slicked streets, 1940s aesthetic, dramatic camera angles, moody lighting, occasional splashes of color for emphasis, cigarette smoke wisps, venetian blind shadows",
  "world_rules": [
    "This is a realistic noir setting - no magic or supernatural elements",
    "Violence has consequences - people can get hurt",
    "Everyone has motives and secrets",
    "The weather reflects the mood - rain, fog, dim streetlights",
    "Dialogue should be snappy and hard-boiled",
    "Trust is rare and often misplaced",
    "The law isn't always on the side of justice",
    "Money and power corrupt everything they touch"
  ]
}
