{
  "constraints": [
    {
      "id": "no_magic",
      "description": "No supernatural or magical abilities",
      "rule": "This is a realistic noir setting. There is no magic, supernatural powers, or fantastical abilities. The Jade Falcon's 'curse' is just superstition. Players cannot use magic or supernatural means.",
      "category": "physical"
    },
    {
      "id": "no_time_travel",
      "description": "Time is linear",
      "rule": "Events happen in chronological order. Players cannot travel through time or undo past actions. What's done is done.",
      "category": "physical"
    },
    {
      "id": "locked_doors_stay_locked",
      "description": "Locked areas require proper access",
      "rule": "Locked locations cannot be entered without the proper key, invitation, or finding an alternative entrance (like picking a lock or finding a window). Simply wanting to enter is not enough.",
      "category": "access"
    },
    {
      "id": "characters_stay_consistent",
      "description": "NPCs have consistent personalities",
      "rule": "Characters behave according to their established personalities and motivations. Vincent Malone won't suddenly become honest, Mr. Chen won't become violent, Murphy won't break the law. Players cannot make NPCs act completely out of character.",
      "category": "social"
    },
    {
      "id": "no_teleportation",
      "description": "Movement is physical",
      "rule": "Players must travel through connected locations. They cannot teleport or instantly appear somewhere. Movement takes time and uses established routes.",
      "category": "physical"
    },
    {
      "id": "items_require_possession",
      "description": "Must have items to use them",
      "rule": "Players can only use items they possess in their inventory. They cannot use items they don't have or that belong to others without first obtaining them.",
      "category": "physical"
    },
    {
      "id": "combat_has_consequences",
      "description": "Violence isn't free",
      "rule": "Fighting has consequences. If the player attacks someone, there may be injury, retaliation, witnesses, or police involvement. The player cannot just attack everyone without repercussions.",
      "category": "social"
    },
    {
      "id": "trust_must_be_earned",
      "description": "NPCs don't trust strangers immediately",
      "rule": "Characters like Mr. Chen and Vincent Malone won't share secrets or allow access to private areas without the player first earning their trust through actions, evidence, or persuasion.",
      "category": "social"
    },
    {
      "id": "historical_accuracy",
      "description": "1940s technology only",
      "rule": "This is 1947. There are no cell phones, computers, internet, or modern technology. Investigation relies on legwork, phone calls from landlines, newspapers, and asking questions in person.",
      "category": "technological"
    },
    {
      "id": "jade_falcon_protected",
      "description": "The Jade Falcon is guarded",
      "rule": "The Jade Falcon is hidden in Warehouse 13 and is guarded by Scarface Tony. It cannot be simply taken without dealing with the guard and gaining access to the warehouse interior.",
      "category": "access"
    },
    {
      "id": "vivian_deception",
      "description": "Vivian is hiding something",
      "rule": "Vivian Lake is not telling the whole truth. She is connected to the theft. Her story has inconsistencies that can be discovered through investigation. She won't simply confess without being confronted with evidence.",
      "category": "social"
    },
    {
      "id": "police_jurisdiction",
      "description": "Police have authority",
      "rule": "The police have legal authority. If the player commits obvious crimes in front of witnesses, there will be consequences. Murphy can help but won't break the law for the player.",
      "category": "social"
    }
  ]
}
