{
  "milestones": [
    {
      "id": "meet_vivian",
      "name": "A Dame Walks In",
      "description": "Meet the mysterious client who sets the story in motion.",
      "condition": "The player has spoken with Vivian Lake and learned about the stolen Jade Falcon.",
      "order": 1,
      "prerequisite_ids": [],
      "hint": "There's a woman in your office who seems to have a story to tell."
    },
    {
      "id": "get_photograph",
      "name": "Picture This",
      "description": "Obtain the photograph of the Jade Falcon as your first clue.",
      "condition": "The player has obtained the photograph of the Jade Falcon from Vivian or found it.",
      "order": 2,
      "prerequisite_ids": ["meet_vivian"],
      "hint": "Ask Vivian about any evidence she might have."
    },
    {
      "id": "visit_chen",
      "name": "The Collector's Knowledge",
      "description": "Learn about the Jade Falcon's history from Mr. Chen.",
      "condition": "The player has spoken with Mr. Chen at the Golden Dragon Antiques and learned about the Jade Falcon's origin and significance.",
      "order": 3,
      "prerequisite_ids": ["get_photograph"],
      "hint": "The Chinatown antique dealer might know something about Chinese artifacts."
    },
    {
      "id": "discover_vincent_connection",
      "name": "Club Connections",
      "description": "Discover that Vincent Malone is somehow connected to the theft.",
      "condition": "The player has found evidence or information linking Vincent Malone to the Jade Falcon theft or the smuggling operation.",
      "order": 4,
      "prerequisite_ids": ["visit_chen"],
      "hint": "Vincent Malone seems to know about everything that happens in this city. Visit the Blue Moon."
    },
    {
      "id": "find_warehouse",
      "name": "Trail to the Docks",
      "description": "Discover that the Jade Falcon is being held at Warehouse 13.",
      "condition": "The player has learned that the Jade Falcon is at Warehouse 13 at the docks, either through investigation, interrogation, or finding evidence.",
      "order": 5,
      "prerequisite_ids": ["discover_vincent_connection"],
      "hint": "Smuggled goods have to come through somewhere. The docks are always worth checking."
    },
    {
      "id": "gain_warehouse_access",
      "name": "Breaking In",
      "description": "Find a way into Warehouse 13.",
      "condition": "The player has gained access to the interior of Warehouse 13, either by obtaining the key, picking the lock, finding another entrance, or dealing with Scarface Tony.",
      "order": 6,
      "prerequisite_ids": ["find_warehouse"],
      "hint": "There has to be a way in. Look for keys, alternative entrances, or ways to distract the guard."
    },
    {
      "id": "recover_falcon",
      "name": "The Jade Falcon",
      "description": "Find and recover the legendary artifact.",
      "condition": "The player has physically obtained the Jade Falcon artifact.",
      "order": 7,
      "prerequisite_ids": ["gain_warehouse_access"],
      "hint": "The Falcon should be inside the warehouse. Find it and take it."
    },
    {
      "id": "expose_truth",
      "name": "The Real Story",
      "description": "Discover the true mastermind behind the theft.",
      "condition": "The player has uncovered the truth about who orchestrated the theft and why - discovering Vivian's true role and her connection to the conspiracy.",
      "order": 8,
      "prerequisite_ids": ["recover_falcon"],
      "hint": "Something about this case doesn't add up. Who really benefits from all this?"
    },
    {
      "id": "final_confrontation",
      "name": "Endgame",
      "description": "Confront the mastermind and bring the case to a close.",
      "condition": "The player has confronted the main antagonist with evidence and resolved the case, either through arrest, confrontation, or revelation.",
      "order": 9,
      "prerequisite_ids": ["expose_truth"],
      "hint": "It's time to confront the truth and end this."
    }
  ]
}
