{
  "title": "Den Store Flukten",
  "synopsis": "En klumsete innbruddstyv sine stadig mer absurde forsøk på å flykte fra politiet etter et bankran som gikk galt.",
  "visual_style": "Golden-age (1940s-1950s) printed comic look: bold black ink outlines, simplified shapes, heavy blacks, and flat CMYK-style color fills. Limited warm palette with faded primaries (red/yellow/blue) plus occasional teal/green, using strong color contrast between large flat areas. Visible newsprint texture, Ben-Day/halftone dot shading, slight ink bleed, and subtle off-register printing. Hand-lettered typography with classic speech balloons and occasional starburst sound effects and speed lines. Extremely minimal detail with sparse backgrounds and generous negative space. Full-bleed composition, no borders, frames, or panel lines. No modern design language, no glossy 3D, no cute/anime styling.",
  "locations": [
    {
      "name": "Sentrum",
      "description": "Busy city streets with shop fronts, fire hydrants, mailboxes, and narrow alleyways. Police sirens echo in the distance."
    },
    {
      "name": "Banken",
      "description": "A grand old bank with marble columns and a vault door left swinging open. The scene of the crime."
    },
    {
      "name": "Forstaden",
      "description": "Quiet residential streets with picket fences, garden gnomes, and nosy neighbors peeking through curtains."
    }
  ],
  "characters": [
    {
      "name": "Vinnie",
      "description": "A scrawny burglar in a black-and-white striped shirt, dark beanie, and a domino mask. Has a friendly, goofy face with big eyes and a gap-toothed grin. Looks like a classic cartoon crook — lovable but clearly not the sharpest tool in the shed."
    }
  ],
  "rules": [
    "Vinnie is spectacularly incompetent — his escape plans are creative but always backfire in hilarious ways.",
    "The police are always just one step behind, creating constant tension and near-misses.",
    "The tone is pure slapstick comedy — think Home Alone burglars. Never dark or violent.",
    "Vinnie's mistakes should involve physical comedy, misunderstandings, and terrible luck."
  ],
  "long_term_narrative": [
    "Vinnie stumbles from one hiding spot to the next, each more ridiculous than the last.",
    "The police net tightens with every failed escape attempt."
  ],
  "narrative_premise": "Vinnie is always on the verge of escape or capture, but through sheer incompetence and dumb luck, the chase never ends — every plan backfires spectacularly, every close call leads to a new ridiculous situation."
}
