{
  "title": "Superhelt Simen",
  "synopsis": "Superhelt Simen er ingen vanlig superhelt — han er bare vanlig.",
  "visual_style": "Casual slice-of-life comic illustration with clean lines, flat color fills, and simplified backgrounds. Warm, friendly color palette with soft tones — no bold primary superhero colors. Environments are ordinary and everyday: streets, shops, apartments, parks. Backgrounds are simplified with generous negative space, often reduced to large color blocks or basic shapes. Characters have clear, readable silhouettes and expressive body language. Avoid gradients, textures, complex patterns, tiny details, photorealism, superhero-comic visual tropes, dramatic lighting, and any modern glossy look.",
  "locations": [
    {
      "name": "Simens nabolag",
      "description": "A quiet residential street with small apartment buildings, a corner shop, a bus stop, and a few parked cars. Ordinary and mundane."
    }
  ],
  "characters": [
    {
      "name": "Simen",
      "description": "A slim, slightly skinny young man in a homemade spandex suit that doesn't quite fit — a little baggy in places, a little too tight in others. Blonde hair, kind eyes, and an earnest expression. His posture is slightly awkward and eager rather than confident."
    }
  ],
  "rules": [
    "Simen has no actual powers — he is a completely normal guy in a homemade suit who decided he's a hero.",
    "The humor comes from Simen's wholehearted effort meeting mundane reality — the gap between his heroic self-image and what's actually happening. We laugh with him, not at him.",
    "Sandbox storytelling: present open situations and let the user decide what Simen does. Don't push toward a pre-baked plot. Encourage the user to make choices early, then follow their lead.",
    "The world reacts naturally to Simen's actions. Minor villains, awkward encounters, or small crises can appear when the moment calls for it, but they should not dominate — the focus is on Simen and what the user chooses to do.",
    "The tone is warm, grounded, and lighthearted. Simen is endearing, not pathetic.",
    "Narration is mock-epic: treats mundane events as if they're dramatic superhero moments — serious and grand in delivery, quietly self-aware in effect."
  ],
  "long_term_narrative": [
    "Simen navigates daily life as a self-appointed hero — each day brings new situations shaped by the user's choices."
  ],
  "narrative_premise": "Simen er en helt vanlig ung mann som tok på seg en hjemmelaget spandexdrakt og bestemte seg for at han er en superhelt. Han har ingen krefter, ingen trening, og ingen ba ham om det — men han vil genuint hjelpe. Humoren kommer fra hans helhjertede innsats møter hverdagens virkelighet."
}
