{
  "title": "Superhero Simen",
  "synopsis": "A genuinely good superhero tries to help everyone in a world that looks normal but is deeply dysfunctional — where selfishness, fear, and misguided values make saving people far harder than any villain ever could.",
  "visual_style": "Classic old-school superhero comic style with vibrant, saturated primary colors, clean bold ink lines, and very minimalistic composition. Simple flat color fills with strong contrast, minimal background detail, and generous negative space. Characters are drawn in a traditional heroic comic book style with clear silhouettes and expressive poses. No modern digital effects, no gradients, no photorealistic rendering. Think classic Silver Age superhero comics: bold, clean, iconic, and immediately readable. Single full-bleed image, no frames, no borders, and no panel structure.",
  "locations": [
    {
      "name": "Simen City",
      "description": "A generic-looking city with office buildings, residential streets, parks, and shops. Everything looks normal and pleasant on the surface, but small details reveal dysfunction — aggressive billboards, hostile architecture, divided neighborhoods."
    },
    {
      "name": "Simen's Rooftop",
      "description": "A quiet rooftop above the city where Simen surveys the streets below. A simple, solitary spot with a wide view of the skyline."
    },
    {
      "name": "City Hall",
      "description": "An imposing government building with grand columns and polished floors. Inside, bureaucrats and politicians operate with confident smiles and questionable priorities."
    }
  ],
  "characters": [
    {
      "name": "Simen",
      "description": "A classic superhero with a strong, athletic build in a traditional red-and-blue suit with a cape and a bold star emblem on the chest. Clean-cut, square jaw, kind eyes, and an earnest expression. He has a timeless, wholesome superhero look — genuinely heroic with no irony or edge. His posture is upright and confident, radiating sincerity and moral clarity. He has blonde hair."
    }
  ],
  "rules": [
    "Simen is genuinely good — not naive, not ironic, not a parody. He truly believes in helping people and doing the right thing.",
    "The world looks normal on the surface but is deeply dysfunctional underneath. People are driven by selfishness, fear, and misguided values — an exaggerated reflection of contemporary right-wing tendencies and social attitudes.",
    "The people Simen encounters are not evil — they are flawed, fearful, selfish, or misguided. They often resist help or create problems through their own attitudes.",
    "The humor and drama come from the contrast between Simen's genuine goodness and the absurd dysfunction of the world around him.",
    "Simen has classic superhero powers: flight, super strength, invulnerability, and heat vision. Nothing extravagant or modernized.",
    "Situations should highlight everyday problems that need fixing — homelessness, inequality, fear of outsiders, environmental neglect, misinformation — through encounters and symbolic villains.",
    "The tone balances genuine heroism with sharp social commentary. Simen never becomes cynical, but the situations he faces test his optimism.",
    "Narration should be straightforward and classic — like a traditional superhero comic narrator, earnest and dramatic."
  ],
  "long_term_narrative": [
    "Simen encounters increasingly complex situations where doing the right thing is made difficult by the dysfunctional world around him.",
    "The people he saves don't always appreciate it, and the systems he works within often undermine his efforts."
  ],
  "narrative_premise": "Superhero Simen genuinely tries to help everyone, but the world around him is so warped by selfishness, fear, and misguided values that saving people becomes a struggle not against villains, but against the very society he's trying to protect. He never gives up, but every good deed reveals another layer of dysfunction."
}
