{
  "title": "Superhero Simen",
  "synopsis": "Simen protects a city of foolish people while battling real disasters and occasional villains.",
  "visual_style": "Classic old-school action comic style with bold, clean ink lines and vibrant but controlled primary colors. Composition is deliberately minimal: simple flat color fills, strong contrast, and clear, readable silhouettes. Backgrounds are highly simplified, often reduced to large color blocks or basic geometric shapes, with generous negative space. No textures, no small details, no complex patterns. Characters are drawn in a traditional comic book style with clear silhouettes and expressive poses. No modern digital effects, no gradients, no photorealism. The image should feel iconic, uncluttered, and immediately readable. Single full-bleed image, no frames, no borders, no panel structure.",
  "locations": [
    {
      "name": "The City",
      "description": "A busy city with office buildings, residential streets, parks, and shops. A perfectly nice place that would be peaceful if not for its remarkably dim-witted population constantly causing problems."
    }
  ],
  "characters": [
    {
      "name": "Simen",
      "description": "A man with an average, non-athletic build wearing a fitted blue-and-yellow costume without a cape. No logo, no symbol, no letter on the chest — the suit is plain and unadorned. He has clean-cut blonde hair, a square jaw, kind eyes, and an earnest expression. His look is timeless and wholesome. His posture is upright and confident, radiating sincerity and warmth."
    }
  ],
  "rules": [
    "Simen is genuinely good — brave, selfless, and dedicated to protecting people. He is a classic hero through and through.",
    "The citizens of The City are hilariously, breathtakingly stupid. They cause accidents, make terrible decisions, ignore obvious dangers, and create chaos through sheer cluelessness. This is the main source of comedy.",
    "Real superhero disasters also happen — buildings collapsing, fires, floods, meteor strikes, runaway trains — classic comic book emergencies that Simen must handle.",
    "Villains may appear with over-the-top evil plans. They should be fun, colorful comic book villains — not deep or symbolic, just entertaining antagonists.",
    "The humor comes from the contrast between Simen's heroic competence and the absurd stupidity of the people he's saving. He does everything right, but the people make it so much harder than it needs to be.",
    "Simen has classic superhero powers: flight, super strength, invulnerability. Nothing extravagant or modernized.",
    "The tone is fun, lighthearted, and action-packed. Think classic superhero adventures with a comedic twist — the hero is great, the people are idiots.",
    "Narration should be straightforward and classic — like a traditional superhero comic narrator, earnest and dramatic."
  ],
  "long_term_narrative": [
    "Simen faces an escalating mix of stupid civilian mishaps, genuine disasters, and villain encounters — each more ridiculous than the last.",
    "Despite the endless stupidity around him, Simen never loses his heroic spirit. He saves everyone, every time, no matter how dumb the situation."
  ],
  "narrative_premise": "Superhero Simen is a genuinely great hero stuck in a city full of spectacularly stupid people. Between saving citizens from their own terrible decisions, battling actual disasters, and fending off the occasional villain, Simen has his hands full — but he never stops being the hero."
}
